In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
import statistics as st

In [ ]:
dict = {'First Score':[100, 90, 30 , 70],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, np.nan]}
df = pd.DataFrame(dict)
df

   First Score  Second Score  Third Score
0          100          30.0          NaN
1           90          45.0         40.0
2           30          56.0         80.0
3           70           NaN          NaN

In [ ]:
#df.isnull()

In [ ]:
df.dropna()

   First Score  Second Score  Third Score
1           90          45.0         40.0
2           30          56.0         80.0

In [ ]:
bool_series = pd.isnull(df["First Score"])
#bool_series
df[bool_series]

   First Score  Second Score  Third Score
2          NaN          56.0         80.0

# filling missing value with some constant (0) using fillna()

In [ ]:
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         70.0           0.0          0.0

In [ ]:
#ab.isnull()

filling a missing value with previous value

In [ ]:
df.fillna(method ='pad')

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         70.0          56.0         80.0

filling a missing value with ahead value

In [ ]:
df.fillna(method ='bfill')

   First Score  Second Score  Third Score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN          NaN

Playing with CSV

In [ ]:
data = pd.read_csv("https://raw.githubusercontent.com/ashokgit/DataSets/main/employees.csv")

In [ ]:
data.shape

(1000, 8)

In [ ]:
choosenDefault = st.mode(data['Gender'])

'Female'

In [ ]:
data.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management     67
Team                  43
dtype: int64

In [ ]:
data.isnull().sum().sum()

322

In [ ]:
data.dropna()

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
5       Dennis    Male  ...             False                 Legal
..         ...     ...  ...               ...                   ...
994     George    Male  ...              True             Marketing
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[764 rows x 8 columns]

In [ ]:
data["Gender"].isnull().sum()

145

In [ ]:
data.shape
data[20:25]

   First Name Gender Start Date  ... Bonus %  Senior Management             Team
20       Lois    NaN  4/22/1995  ...   4.934               True            Legal
21    Matthew   Male   9/5/1995  ...  13.645              False        Marketing
22     Joshua    NaN   3/8/2012  ...  18.816               True  Client Services
23        NaN   Male  6/14/2012  ...   5.042                NaN              NaN
24       John   Male   7/1/1992  ...  13.873              False  Client Services

[5 rows x 8 columns]

In [ ]:
bool_series = pd.isnull(data["Gender"])

In [ ]:
data[bool_series]

    First Name Gender  ... Senior Management                  Team
20        Lois    NaN  ...              True                 Legal
22      Joshua    NaN  ...              True       Client Services
27       Scott    NaN  ...             False                 Legal
31       Joyce    NaN  ...             False               Product
41   Christine    NaN  ...              True  Business Development
..         ...    ...  ...               ...                   ...
961    Antonio    NaN  ...             False                 Legal
972     Victor    NaN  ...              True                 Sales
985    Stephen    NaN  ...             False                 Legal
989     Justin    NaN  ...             False                 Legal
995      Henry    NaN  ...             False          Distribution

[145 rows x 8 columns]

In [ ]:
#bool_series = pd.notnull(data["Gender"])

In [ ]:
#data[bool_series]

*   What is the total no of rows?
*   Find how many data items / rows have null values
*   Find how many data items / rows for Gender have null values
*   Of those which are filled, how many are Male and how many are female



---

In [ ]:
data["Gender"].fillna("No Gender", inplace = True)

In [ ]:
data.isnull().sum().sum()

322

In [ ]:
data[20:25]

   First Name     Gender Start Date  ... Bonus %  Senior Management             Team
20       Lois  No Gender  4/22/1995  ...   4.934               True            Legal
21    Matthew       Male   9/5/1995  ...  13.645              False        Marketing
22     Joshua  No Gender   3/8/2012  ...  18.816               True  Client Services
23        NaN       Male  6/14/2012  ...   5.042                NaN              NaN
24       John       Male   7/1/1992  ...  13.873              False  Client Services

[5 rows x 8 columns]

In [ ]:
data.replace(to_replace = np.nan, value = -99)

    First Name     Gender  ... Senior Management                  Team
0      Douglas       Male  ...              True             Marketing
1       Thomas       Male  ...              True                   -99
2        Maria     Female  ...             False               Finance
3        Jerry       Male  ...              True               Finance
4        Larry       Male  ...              True       Client Services
..         ...        ...  ...               ...                   ...
995      Henry  No Gender  ...             False          Distribution
996    Phillip       Male  ...             False               Finance
997    Russell       Male  ...             False               Product
998      Larry       Male  ...             False  Business Development
999     Albert       Male  ...              True                 Sales

[1000 rows x 8 columns]

In [ ]:
data.corr()

           Salary   Bonus %
Salary   1.000000 -0.036381
Bonus % -0.036381  1.000000